<?php
$teacher = array(
    "Фамилия" => "Лаврецкая",
    "Имя" => "Елизавета",
    "Отчество" => "Викторовна",
    "Дата рождения" => "25.06.1980",
    "Должность" => "Преподаватель",
    "Основная должность" => "Заместитель директора по УР",
    "Категория" => "Высшая",
    "Уровень образования" => "Высшее профессиональное",
    "Учебное заведение" => "Московский государственный институт электронной техники (технический университет)",
    "Квалификация" => "Менеджер",
    "Специализация" => "Менеджмент организации",
    "Стаж в учебном заведении" => 19,
    "Полный стаж" => 22,
    "E-mail" => "lovel@mail.ru"
);

var_dump($teacher);
?>