import java.util.Scanner;
import java.util.Random;
import java.util.Arrays;
public class Main
{
   // 18. Напишите программу, которая выводит все четные цифры.

   
	public static void main(String[] args) {
        for(int i=1; i<100; i++){
            if(i%2==0){
                System.out.println("Четные числа до 100: "+i);
            }
        }

}  
}


