import java.util.Scanner;
public class Main
{
   // 5. Напишите программу, действием которой будет создание одномерного массива и вывод его на экран
	public static void main(String[] args) {
        int[] arr = {1,2,3,4,5};
        System.out.println(arr);

}  
}


