import java.util.Scanner;
import java.util.Random;
import java.util.Arrays;
public class Main
{
   //6. Напишите программу, действием которой будет создание массива и заполнение его цифрами от 100 до 80.
	public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        System.out.println("Введите количество элементов в массиве(а потом он сам за тебя заполнит массив): ")
        int n = sc.nextInt();
        int[] arr = new int[n];
        Random random = new Random();
      
        arr = Arrays.stream(arr)
            

}  
}


