import java.util.Scanner;
public class Main
{
    // 1.Напишите программу, которая выводит построчно на экран таблицу умножения
	public static void main(String[] args) {
         for(int i=0; i<10; i++) {
            for(int j=1;j<10;j++){
                System.out.println(i*j);
            }
        }

}  
}


